// Generated by jextract

package com.github.cubiomes;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$74 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$74() {}
    static final StructLayout const$0 = MemoryLayout.structLayout(
        MemoryLayout.sequenceLayout(8, MemoryLayout.structLayout(
            MemoryLayout.sequenceLayout(257, JAVA_BYTE).withName("d"),
            JAVA_BYTE.withName("h2"),
            MemoryLayout.paddingLayout(6),
            JAVA_DOUBLE.withName("a"),
            JAVA_DOUBLE.withName("b"),
            JAVA_DOUBLE.withName("c"),
            JAVA_DOUBLE.withName("amplitude"),
            JAVA_DOUBLE.withName("lacunarity"),
            JAVA_DOUBLE.withName("d2"),
            JAVA_DOUBLE.withName("t2")
        ).withName("PerlinNoise")).withName("oct"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("oreVeininess"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("oreVeinA"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("oreVeinB"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("oreGap"),
        MemoryLayout.structLayout(
            JAVA_LONG.withName("lo"),
            JAVA_LONG.withName("hi")
        ).withName("posRandom")
    ).withName("OreVeinParameters");
    static final MethodHandle const$1 = RuntimeHelper.downcallHandle(
        "initOreVeinNoise",
        constants$40.const$4
    );
    static final MethodHandle const$2 = RuntimeHelper.downcallHandle(
        "getOreVeinBlockAt",
        constants$64.const$3
    );
    static final StructLayout const$3 = MemoryLayout.structLayout(
        JAVA_INT.withName("dim"),
        JAVA_FLOAT.withName("probability"),
        JAVA_INT.withName("carverIndex"),
        JAVA_INT.withName("range"),
        RuntimeHelper.POINTER.withName("y"),
        JAVA_INT.withName("minY"),
        JAVA_INT.withName("maxY"),
        JAVA_INT.withName("innerY"),
        JAVA_FLOAT.withName("yScale"),
        RuntimeHelper.POINTER.withName("verticalRotation"),
        JAVA_FLOAT.withName("minVerRot"),
        JAVA_FLOAT.withName("maxVerRot"),
        RuntimeHelper.POINTER.withName("distanceFactor"),
        JAVA_FLOAT.withName("minDistance"),
        JAVA_FLOAT.withName("maxDistance"),
        RuntimeHelper.POINTER.withName("thickness"),
        JAVA_FLOAT.withName("minThickness"),
        JAVA_FLOAT.withName("maxThickness"),
        JAVA_FLOAT.withName("plateauThickness"),
        JAVA_INT.withName("widthSmoothness"),
        RuntimeHelper.POINTER.withName("horizontalRadiusFactor"),
        JAVA_FLOAT.withName("minHorRadius"),
        JAVA_FLOAT.withName("maxHorRadius"),
        JAVA_FLOAT.withName("verticalRadiusDefaultFactor"),
        JAVA_FLOAT.withName("verticalRadiusCenterFactor")
    ).withName("CanyonCarverConfig");
    static final VarHandle const$4 = constants$74.const$3.varHandle(MemoryLayout.PathElement.groupElement("dim"));
    static final VarHandle const$5 = constants$74.const$3.varHandle(MemoryLayout.PathElement.groupElement("probability"));
}


