// Generated by jextract

package com.github.cubiomes;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$44 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$44() {}
    static final StructLayout const$0 = MemoryLayout.structLayout(
        JAVA_INT.withName("mc"),
        JAVA_INT.withName("dim"),
        JAVA_INT.withName("flags"),
        MemoryLayout.paddingLayout(4),
        JAVA_LONG.withName("seed"),
        JAVA_LONG.withName("sha"),
        MemoryLayout.unionLayout(
            MemoryLayout.structLayout(
                MemoryLayout.structLayout(
                    MemoryLayout.sequenceLayout(61, MemoryLayout.structLayout(
                        RuntimeHelper.POINTER.withName("getMap"),
                        JAVA_BYTE.withName("mc"),
                        JAVA_BYTE.withName("zoom"),
                        JAVA_BYTE.withName("edge"),
                        MemoryLayout.paddingLayout(1),
                        JAVA_INT.withName("scale"),
                        JAVA_LONG.withName("layerSalt"),
                        JAVA_LONG.withName("startSalt"),
                        JAVA_LONG.withName("startSeed"),
                        RuntimeHelper.POINTER.withName("noise"),
                        RuntimeHelper.POINTER.withName("data"),
                        RuntimeHelper.POINTER.withName("p"),
                        RuntimeHelper.POINTER.withName("p2")
                    ).withName("Layer")).withName("layers"),
                    RuntimeHelper.POINTER.withName("entry_1"),
                    RuntimeHelper.POINTER.withName("entry_4"),
                    RuntimeHelper.POINTER.withName("entry_16"),
                    RuntimeHelper.POINTER.withName("entry_64"),
                    RuntimeHelper.POINTER.withName("entry_256"),
                    MemoryLayout.structLayout(
                        MemoryLayout.sequenceLayout(257, JAVA_BYTE).withName("d"),
                        JAVA_BYTE.withName("h2"),
                        MemoryLayout.paddingLayout(6),
                        JAVA_DOUBLE.withName("a"),
                        JAVA_DOUBLE.withName("b"),
                        JAVA_DOUBLE.withName("c"),
                        JAVA_DOUBLE.withName("amplitude"),
                        JAVA_DOUBLE.withName("lacunarity"),
                        JAVA_DOUBLE.withName("d2"),
                        JAVA_DOUBLE.withName("t2")
                    ).withName("oceanRnd")
                ).withName("ls"),
                MemoryLayout.sequenceLayout(5, MemoryLayout.structLayout(
                    RuntimeHelper.POINTER.withName("getMap"),
                    JAVA_BYTE.withName("mc"),
                    JAVA_BYTE.withName("zoom"),
                    JAVA_BYTE.withName("edge"),
                    MemoryLayout.paddingLayout(1),
                    JAVA_INT.withName("scale"),
                    JAVA_LONG.withName("layerSalt"),
                    JAVA_LONG.withName("startSalt"),
                    JAVA_LONG.withName("startSeed"),
                    RuntimeHelper.POINTER.withName("noise"),
                    RuntimeHelper.POINTER.withName("data"),
                    RuntimeHelper.POINTER.withName("p"),
                    RuntimeHelper.POINTER.withName("p2")
                ).withName("Layer")).withName("xlayer"),
                RuntimeHelper.POINTER.withName("entry")
            ).withName("$anon$0"),
            MemoryLayout.structLayout(
                MemoryLayout.structLayout(
                    MemoryLayout.sequenceLayout(6, MemoryLayout.structLayout(
                        JAVA_DOUBLE.withName("amplitude"),
                        MemoryLayout.structLayout(
                            JAVA_INT.withName("octcnt"),
                            MemoryLayout.paddingLayout(4),
                            RuntimeHelper.POINTER.withName("octaves")
                        ).withName("octA"),
                        MemoryLayout.structLayout(
                            JAVA_INT.withName("octcnt"),
                            MemoryLayout.paddingLayout(4),
                            RuntimeHelper.POINTER.withName("octaves")
                        ).withName("octB")
                    ).withName("DoublePerlinNoise")).withName("climate"),
                    MemoryLayout.sequenceLayout(46, MemoryLayout.structLayout(
                        MemoryLayout.sequenceLayout(257, JAVA_BYTE).withName("d"),
                        JAVA_BYTE.withName("h2"),
                        MemoryLayout.paddingLayout(6),
                        JAVA_DOUBLE.withName("a"),
                        JAVA_DOUBLE.withName("b"),
                        JAVA_DOUBLE.withName("c"),
                        JAVA_DOUBLE.withName("amplitude"),
                        JAVA_DOUBLE.withName("lacunarity"),
                        JAVA_DOUBLE.withName("d2"),
                        JAVA_DOUBLE.withName("t2")
                    ).withName("PerlinNoise")).withName("oct"),
                    RuntimeHelper.POINTER.withName("sp"),
                    MemoryLayout.structLayout(
                        MemoryLayout.sequenceLayout(42, MemoryLayout.structLayout(
                            JAVA_INT.withName("len"),
                            JAVA_INT.withName("typ"),
                            MemoryLayout.sequenceLayout(12, JAVA_FLOAT).withName("loc"),
                            MemoryLayout.sequenceLayout(12, JAVA_FLOAT).withName("der"),
                            MemoryLayout.sequenceLayout(12, RuntimeHelper.POINTER).withName("val")
                        ).withName("Spline")).withName("stack"),
                        MemoryLayout.sequenceLayout(151, MemoryLayout.structLayout(
                            JAVA_INT.withName("len"),
                            JAVA_FLOAT.withName("val")
                        ).withName("FixSpline")).withName("fstack"),
                        JAVA_INT.withName("len"),
                        JAVA_INT.withName("flen")
                    ).withName("ss"),
                    JAVA_INT.withName("nptype"),
                    JAVA_INT.withName("mc")
                ).withName("bn")
            ).withName("$anon$1"),
            MemoryLayout.structLayout(
                MemoryLayout.structLayout(
                    MemoryLayout.sequenceLayout(3, MemoryLayout.structLayout(
                        JAVA_INT.withName("octcnt"),
                        MemoryLayout.paddingLayout(4),
                        RuntimeHelper.POINTER.withName("octaves")
                    ).withName("OctaveNoise")).withName("climate"),
                    MemoryLayout.sequenceLayout(10, MemoryLayout.structLayout(
                        MemoryLayout.sequenceLayout(257, JAVA_BYTE).withName("d"),
                        JAVA_BYTE.withName("h2"),
                        MemoryLayout.paddingLayout(6),
                        JAVA_DOUBLE.withName("a"),
                        JAVA_DOUBLE.withName("b"),
                        JAVA_DOUBLE.withName("c"),
                        JAVA_DOUBLE.withName("amplitude"),
                        JAVA_DOUBLE.withName("lacunarity"),
                        JAVA_DOUBLE.withName("d2"),
                        JAVA_DOUBLE.withName("t2")
                    ).withName("PerlinNoise")).withName("oct"),
                    JAVA_INT.withName("nptype"),
                    JAVA_INT.withName("mc")
                ).withName("bnb")
            ).withName("$anon$2")
        ).withName("$anon$0"),
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                JAVA_DOUBLE.withName("amplitude"),
                MemoryLayout.structLayout(
                    JAVA_INT.withName("octcnt"),
                    MemoryLayout.paddingLayout(4),
                    RuntimeHelper.POINTER.withName("octaves")
                ).withName("octA"),
                MemoryLayout.structLayout(
                    JAVA_INT.withName("octcnt"),
                    MemoryLayout.paddingLayout(4),
                    RuntimeHelper.POINTER.withName("octaves")
                ).withName("octB")
            ).withName("temperature"),
            MemoryLayout.structLayout(
                JAVA_DOUBLE.withName("amplitude"),
                MemoryLayout.structLayout(
                    JAVA_INT.withName("octcnt"),
                    MemoryLayout.paddingLayout(4),
                    RuntimeHelper.POINTER.withName("octaves")
                ).withName("octA"),
                MemoryLayout.structLayout(
                    JAVA_INT.withName("octcnt"),
                    MemoryLayout.paddingLayout(4),
                    RuntimeHelper.POINTER.withName("octaves")
                ).withName("octB")
            ).withName("humidity"),
            MemoryLayout.sequenceLayout(8, MemoryLayout.structLayout(
                MemoryLayout.sequenceLayout(257, JAVA_BYTE).withName("d"),
                JAVA_BYTE.withName("h2"),
                MemoryLayout.paddingLayout(6),
                JAVA_DOUBLE.withName("a"),
                JAVA_DOUBLE.withName("b"),
                JAVA_DOUBLE.withName("c"),
                JAVA_DOUBLE.withName("amplitude"),
                JAVA_DOUBLE.withName("lacunarity"),
                JAVA_DOUBLE.withName("d2"),
                JAVA_DOUBLE.withName("t2")
            ).withName("PerlinNoise")).withName("oct")
        ).withName("nn"),
        MemoryLayout.structLayout(
            MemoryLayout.structLayout(
                MemoryLayout.sequenceLayout(257, JAVA_BYTE).withName("d"),
                JAVA_BYTE.withName("h2"),
                MemoryLayout.paddingLayout(6),
                JAVA_DOUBLE.withName("a"),
                JAVA_DOUBLE.withName("b"),
                JAVA_DOUBLE.withName("c"),
                JAVA_DOUBLE.withName("amplitude"),
                JAVA_DOUBLE.withName("lacunarity"),
                JAVA_DOUBLE.withName("d2"),
                JAVA_DOUBLE.withName("t2")
            ).withName("perlin"),
            JAVA_INT.withName("mc"),
            MemoryLayout.paddingLayout(4)
        ).withName("en")
    ).withName("Generator");
    static final VarHandle const$1 = constants$44.const$0.varHandle(MemoryLayout.PathElement.groupElement("mc"));
    static final VarHandle const$2 = constants$44.const$0.varHandle(MemoryLayout.PathElement.groupElement("dim"));
    static final VarHandle const$3 = constants$44.const$0.varHandle(MemoryLayout.PathElement.groupElement("flags"));
    static final VarHandle const$4 = constants$44.const$0.varHandle(MemoryLayout.PathElement.groupElement("seed"));
    static final VarHandle const$5 = constants$44.const$0.varHandle(MemoryLayout.PathElement.groupElement("sha"));
}


