// Generated by jextract

package com.github.cubiomes;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$72 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$72() {}
    static final FunctionDescriptor const$0 = FunctionDescriptor.of(MemoryLayout.structLayout(
        JAVA_INT.withName("x"),
        JAVA_INT.withName("y"),
        JAVA_INT.withName("z")
    ).withName("Pos3"),
        JAVA_INT,
        MemoryLayout.structLayout(
            JAVA_INT.withName("index"),
            JAVA_INT.withName("step"),
            JAVA_INT.withName("size"),
            JAVA_INT.withName("repeatCount"),
            RuntimeHelper.POINTER.withName("heightProvider"),
            JAVA_INT.withName("h1"),
            JAVA_INT.withName("h2"),
            JAVA_INT.withName("h3"),
            JAVA_INT.withName("oreType"),
            JAVA_INT.withName("oreBlock"),
            JAVA_BYTE.withName("dim"),
            JAVA_BYTE.withName("numReplaceBlocks"),
            MemoryLayout.paddingLayout(2),
            RuntimeHelper.POINTER.withName("replaceBlocks"),
            JAVA_FLOAT.withName("discardChanceOnAirExposure"),
            MemoryLayout.paddingLayout(4)
        ).withName("OreConfig"),
        JAVA_INT,
        JAVA_INT,
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("state"),
            RuntimeHelper.POINTER.withName("setSeed"),
            RuntimeHelper.POINTER.withName("nextLong"),
            RuntimeHelper.POINTER.withName("nextInt"),
            RuntimeHelper.POINTER.withName("nextFloat"),
            RuntimeHelper.POINTER.withName("nextDouble"),
            RuntimeHelper.POINTER.withName("nextIntBetween")
        ).withName("RandomSource")
    );
    static final MethodHandle const$1 = RuntimeHelper.downcallHandle(
        "generateBaseOrePosition",
        constants$72.const$0
    );
    static final FunctionDescriptor const$2 = FunctionDescriptor.ofVoid(
        RuntimeHelper.POINTER,
        RuntimeHelper.POINTER,
        MemoryLayout.structLayout(
            JAVA_INT.withName("index"),
            JAVA_INT.withName("step"),
            JAVA_INT.withName("size"),
            JAVA_INT.withName("repeatCount"),
            RuntimeHelper.POINTER.withName("heightProvider"),
            JAVA_INT.withName("h1"),
            JAVA_INT.withName("h2"),
            JAVA_INT.withName("h3"),
            JAVA_INT.withName("oreType"),
            JAVA_INT.withName("oreBlock"),
            JAVA_BYTE.withName("dim"),
            JAVA_BYTE.withName("numReplaceBlocks"),
            MemoryLayout.paddingLayout(2),
            RuntimeHelper.POINTER.withName("replaceBlocks"),
            JAVA_FLOAT.withName("discardChanceOnAirExposure"),
            MemoryLayout.paddingLayout(4)
        ).withName("OreConfig"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("x"),
            JAVA_INT.withName("y"),
            JAVA_INT.withName("z")
        ).withName("Pos3"),
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("state"),
            RuntimeHelper.POINTER.withName("setSeed"),
            RuntimeHelper.POINTER.withName("nextLong"),
            RuntimeHelper.POINTER.withName("nextInt"),
            RuntimeHelper.POINTER.withName("nextFloat"),
            RuntimeHelper.POINTER.withName("nextDouble"),
            RuntimeHelper.POINTER.withName("nextIntBetween")
        ).withName("RandomSource"),
        RuntimeHelper.POINTER
    );
    static final MethodHandle const$3 = RuntimeHelper.downcallHandle(
        "generateOrePositions",
        constants$72.const$2
    );
    static final FunctionDescriptor const$4 = FunctionDescriptor.ofVoid(
        JAVA_INT,
        MemoryLayout.structLayout(
            JAVA_INT.withName("index"),
            JAVA_INT.withName("step"),
            JAVA_INT.withName("size"),
            JAVA_INT.withName("repeatCount"),
            RuntimeHelper.POINTER.withName("heightProvider"),
            JAVA_INT.withName("h1"),
            JAVA_INT.withName("h2"),
            JAVA_INT.withName("h3"),
            JAVA_INT.withName("oreType"),
            JAVA_INT.withName("oreBlock"),
            JAVA_BYTE.withName("dim"),
            JAVA_BYTE.withName("numReplaceBlocks"),
            MemoryLayout.paddingLayout(2),
            RuntimeHelper.POINTER.withName("replaceBlocks"),
            JAVA_FLOAT.withName("discardChanceOnAirExposure"),
            MemoryLayout.paddingLayout(4)
        ).withName("OreConfig"),
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("state"),
            RuntimeHelper.POINTER.withName("setSeed"),
            RuntimeHelper.POINTER.withName("nextLong"),
            RuntimeHelper.POINTER.withName("nextInt"),
            RuntimeHelper.POINTER.withName("nextFloat"),
            RuntimeHelper.POINTER.withName("nextDouble"),
            RuntimeHelper.POINTER.withName("nextIntBetween")
        ).withName("RandomSource"),
        JAVA_DOUBLE,
        JAVA_DOUBLE,
        JAVA_DOUBLE,
        JAVA_DOUBLE,
        JAVA_DOUBLE,
        JAVA_DOUBLE,
        JAVA_INT,
        JAVA_INT,
        JAVA_INT,
        JAVA_INT,
        JAVA_INT,
        RuntimeHelper.POINTER
    );
    static final MethodHandle const$5 = RuntimeHelper.downcallHandle(
        "generateVeinPart",
        constants$72.const$4
    );
}


