// Generated by jextract

package com.github.cubiomes;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$31 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$31() {}
    static final VarHandle const$0 = constants$30.const$0.varHandle(MemoryLayout.PathElement.groupElement("yMultiplier"));
    static final VarHandle const$1 = constants$30.const$0.varHandle(MemoryLayout.PathElement.groupElement("smearScaleMultiplier"));
    static final VarHandle const$2 = constants$30.const$0.varHandle(MemoryLayout.PathElement.groupElement("smearedYScale"));
    static final VarHandle const$3 = constants$30.const$0.varHandle(MemoryLayout.PathElement.groupElement("factoredSmearedYScale"));
    static final StructLayout const$4 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            MemoryLayout.sequenceLayout(6, MemoryLayout.structLayout(
                JAVA_DOUBLE.withName("amplitude"),
                MemoryLayout.structLayout(
                    JAVA_INT.withName("octcnt"),
                    MemoryLayout.paddingLayout(4),
                    RuntimeHelper.POINTER.withName("octaves")
                ).withName("octA"),
                MemoryLayout.structLayout(
                    JAVA_INT.withName("octcnt"),
                    MemoryLayout.paddingLayout(4),
                    RuntimeHelper.POINTER.withName("octaves")
                ).withName("octB")
            ).withName("DoublePerlinNoise")).withName("climate"),
            MemoryLayout.sequenceLayout(46, MemoryLayout.structLayout(
                MemoryLayout.sequenceLayout(257, JAVA_BYTE).withName("d"),
                JAVA_BYTE.withName("h2"),
                MemoryLayout.paddingLayout(6),
                JAVA_DOUBLE.withName("a"),
                JAVA_DOUBLE.withName("b"),
                JAVA_DOUBLE.withName("c"),
                JAVA_DOUBLE.withName("amplitude"),
                JAVA_DOUBLE.withName("lacunarity"),
                JAVA_DOUBLE.withName("d2"),
                JAVA_DOUBLE.withName("t2")
            ).withName("PerlinNoise")).withName("oct"),
            RuntimeHelper.POINTER.withName("sp"),
            MemoryLayout.structLayout(
                MemoryLayout.sequenceLayout(42, MemoryLayout.structLayout(
                    JAVA_INT.withName("len"),
                    JAVA_INT.withName("typ"),
                    MemoryLayout.sequenceLayout(12, JAVA_FLOAT).withName("loc"),
                    MemoryLayout.sequenceLayout(12, JAVA_FLOAT).withName("der"),
                    MemoryLayout.sequenceLayout(12, RuntimeHelper.POINTER).withName("val")
                ).withName("Spline")).withName("stack"),
                MemoryLayout.sequenceLayout(151, MemoryLayout.structLayout(
                    JAVA_INT.withName("len"),
                    JAVA_FLOAT.withName("val")
                ).withName("FixSpline")).withName("fstack"),
                JAVA_INT.withName("len"),
                JAVA_INT.withName("flen")
            ).withName("ss"),
            JAVA_INT.withName("nptype"),
            JAVA_INT.withName("mc")
        ).withName("bn"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("xzScale"),
            JAVA_DOUBLE.withName("yScale"),
            JAVA_DOUBLE.withName("xzFactor"),
            JAVA_DOUBLE.withName("yFactor"),
            JAVA_DOUBLE.withName("xzMultiplier"),
            JAVA_DOUBLE.withName("yMultiplier"),
            JAVA_DOUBLE.withName("smearScaleMultiplier"),
            JAVA_DOUBLE.withName("smearedYScale"),
            JAVA_DOUBLE.withName("factoredSmearedYScale"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octmin"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octmax"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octmain"),
            MemoryLayout.sequenceLayout(40, MemoryLayout.structLayout(
                MemoryLayout.sequenceLayout(257, JAVA_BYTE).withName("d"),
                JAVA_BYTE.withName("h2"),
                MemoryLayout.paddingLayout(6),
                JAVA_DOUBLE.withName("a"),
                JAVA_DOUBLE.withName("b"),
                JAVA_DOUBLE.withName("c"),
                JAVA_DOUBLE.withName("amplitude"),
                JAVA_DOUBLE.withName("lacunarity"),
                JAVA_DOUBLE.withName("d2"),
                JAVA_DOUBLE.withName("t2")
            ).withName("PerlinNoise")).withName("oct")
        ).withName("bln"),
        MemoryLayout.structLayout(
            MemoryLayout.sequenceLayout(42, MemoryLayout.structLayout(
                JAVA_INT.withName("len"),
                JAVA_INT.withName("typ"),
                MemoryLayout.sequenceLayout(12, JAVA_FLOAT).withName("loc"),
                MemoryLayout.sequenceLayout(12, JAVA_FLOAT).withName("der"),
                MemoryLayout.sequenceLayout(12, RuntimeHelper.POINTER).withName("val")
            ).withName("Spline")).withName("stack"),
            MemoryLayout.sequenceLayout(151, MemoryLayout.structLayout(
                JAVA_INT.withName("len"),
                JAVA_FLOAT.withName("val")
            ).withName("FixSpline")).withName("fstack"),
            JAVA_INT.withName("len"),
            JAVA_INT.withName("flen")
        ).withName("ss"),
        RuntimeHelper.POINTER.withName("factorSpline"),
        RuntimeHelper.POINTER.withName("jaggednessSpline"),
        MemoryLayout.sequenceLayout(90, MemoryLayout.structLayout(
            MemoryLayout.sequenceLayout(257, JAVA_BYTE).withName("d"),
            JAVA_BYTE.withName("h2"),
            MemoryLayout.paddingLayout(6),
            JAVA_DOUBLE.withName("a"),
            JAVA_DOUBLE.withName("b"),
            JAVA_DOUBLE.withName("c"),
            JAVA_DOUBLE.withName("amplitude"),
            JAVA_DOUBLE.withName("lacunarity"),
            JAVA_DOUBLE.withName("d2"),
            JAVA_DOUBLE.withName("t2")
        ).withName("PerlinNoise")).withName("oct"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("pillar"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("pillarRareness"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("pillarThickness"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("spaghetti2d"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("spaghetti2dElevation"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("spaghetti2dModulator"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("spaghetti2dThickness"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("spaghetti3d1"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("spaghetti3d2"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("spaghetti3dRarity"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("spaghetti3dThickness"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("spaghettiRoughness"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("spaghettiRoughnessModulator"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("caveEntrance"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("caveLayer"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("caveCheese"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("noodle"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("noodleThickness"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("noodleRidgeA"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("noodleRidgeB"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("jagged")
    ).withName("TerrainNoiseParameters");
    static final VarHandle const$5 = constants$31.const$4.varHandle(MemoryLayout.PathElement.groupElement("factorSpline"));
}


