// Generated by jextract

package com.github.cubiomes;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$24 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$24() {}
    static final VarHandle const$0 = constants$23.const$0.varHandle(MemoryLayout.PathElement.groupElement("y"));
    static final VarHandle const$1 = constants$23.const$0.varHandle(MemoryLayout.PathElement.groupElement("sy"));
    static final StructLayout const$2 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("temperature"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("amplitude"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octA"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("octcnt"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("octaves")
            ).withName("octB")
        ).withName("humidity"),
        MemoryLayout.sequenceLayout(8, MemoryLayout.structLayout(
            MemoryLayout.sequenceLayout(257, JAVA_BYTE).withName("d"),
            JAVA_BYTE.withName("h2"),
            MemoryLayout.paddingLayout(6),
            JAVA_DOUBLE.withName("a"),
            JAVA_DOUBLE.withName("b"),
            JAVA_DOUBLE.withName("c"),
            JAVA_DOUBLE.withName("amplitude"),
            JAVA_DOUBLE.withName("lacunarity"),
            JAVA_DOUBLE.withName("d2"),
            JAVA_DOUBLE.withName("t2")
        ).withName("PerlinNoise")).withName("oct")
    ).withName("NetherNoise");
    static final StructLayout const$3 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            MemoryLayout.sequenceLayout(257, JAVA_BYTE).withName("d"),
            JAVA_BYTE.withName("h2"),
            MemoryLayout.paddingLayout(6),
            JAVA_DOUBLE.withName("a"),
            JAVA_DOUBLE.withName("b"),
            JAVA_DOUBLE.withName("c"),
            JAVA_DOUBLE.withName("amplitude"),
            JAVA_DOUBLE.withName("lacunarity"),
            JAVA_DOUBLE.withName("d2"),
            JAVA_DOUBLE.withName("t2")
        ).withName("perlin"),
        JAVA_INT.withName("mc"),
        MemoryLayout.paddingLayout(4)
    ).withName("EndNoise");
    static final VarHandle const$4 = constants$24.const$3.varHandle(MemoryLayout.PathElement.groupElement("mc"));
    static final StructLayout const$5 = MemoryLayout.structLayout(
        JAVA_DOUBLE.withName("xzScale"),
        JAVA_DOUBLE.withName("yScale"),
        JAVA_DOUBLE.withName("xzFactor"),
        JAVA_DOUBLE.withName("yFactor"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("octcnt"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("octaves")
        ).withName("octmin"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("octcnt"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("octaves")
        ).withName("octmax"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("octcnt"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("octaves")
        ).withName("octmain"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("octcnt"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("octaves")
        ).withName("octsurf"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("octcnt"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("octaves")
        ).withName("octdepth"),
        MemoryLayout.sequenceLayout(60, MemoryLayout.structLayout(
            MemoryLayout.sequenceLayout(257, JAVA_BYTE).withName("d"),
            JAVA_BYTE.withName("h2"),
            MemoryLayout.paddingLayout(6),
            JAVA_DOUBLE.withName("a"),
            JAVA_DOUBLE.withName("b"),
            JAVA_DOUBLE.withName("c"),
            JAVA_DOUBLE.withName("amplitude"),
            JAVA_DOUBLE.withName("lacunarity"),
            JAVA_DOUBLE.withName("d2"),
            JAVA_DOUBLE.withName("t2")
        ).withName("PerlinNoise")).withName("oct")
    ).withName("SurfaceNoise");
}


