// Generated by jextract

package com.github.cubiomes;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$25 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$25() {}
    static final VarHandle const$0 = constants$24.const$5.varHandle(MemoryLayout.PathElement.groupElement("xzScale"));
    static final VarHandle const$1 = constants$24.const$5.varHandle(MemoryLayout.PathElement.groupElement("yScale"));
    static final VarHandle const$2 = constants$24.const$5.varHandle(MemoryLayout.PathElement.groupElement("xzFactor"));
    static final VarHandle const$3 = constants$24.const$5.varHandle(MemoryLayout.PathElement.groupElement("yFactor"));
    static final StructLayout const$4 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            JAVA_INT.withName("octcnt"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("octaves")
        ).withName("octmin"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("octcnt"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("octaves")
        ).withName("octmax"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("octcnt"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("octaves")
        ).withName("octmain"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("octcnt"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("octaves")
        ).withName("octcontA"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("octcnt"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("octaves")
        ).withName("octcontB"),
        MemoryLayout.sequenceLayout(66, MemoryLayout.structLayout(
            MemoryLayout.sequenceLayout(257, JAVA_BYTE).withName("d"),
            JAVA_BYTE.withName("h2"),
            MemoryLayout.paddingLayout(6),
            JAVA_DOUBLE.withName("a"),
            JAVA_DOUBLE.withName("b"),
            JAVA_DOUBLE.withName("c"),
            JAVA_DOUBLE.withName("amplitude"),
            JAVA_DOUBLE.withName("lacunarity"),
            JAVA_DOUBLE.withName("d2"),
            JAVA_DOUBLE.withName("t2")
        ).withName("PerlinNoise")).withName("oct")
    ).withName("SurfaceNoiseBeta");
    static final StructLayout const$5 = MemoryLayout.structLayout(
        JAVA_DOUBLE.withName("contASample"),
        JAVA_DOUBLE.withName("contBSample"),
        MemoryLayout.sequenceLayout(2, JAVA_DOUBLE).withName("minSample"),
        MemoryLayout.sequenceLayout(2, JAVA_DOUBLE).withName("maxSample"),
        MemoryLayout.sequenceLayout(2, JAVA_DOUBLE).withName("mainSample")
    ).withName("SeaLevelColumnNoiseBeta");
}


